zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
				/*
				 * Set the PAN-Id of the scanned network.
				 * This is required in order to perform a proper
				 *sync
				 * before assocation.
				 * Use: bool wpan_mlme_set_req(uint8_t
				 *PIBAttribute,
				 *                             void
				 **PIBAttributeValue);
				 *
				 * This request leads to a set confirm message
				 *-> usr_mlme_set_conf
				 */
				uint16_t pan_id;
				pan_id = DEFAULT_PAN_ID;
				wpan_mlme_set_req(macPANId,NO_PIB_INDEX, &pan_id);
				
				return;
			}

			/* Get the next PAN descriptor. */
			coordinator++;
		}

		/*
		 * If here, the result list does not contain our expected
		 *coordinator.
		 * Let's scan again.
		 */
		wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
				SCAN_CHANNEL,
				SCAN_DURATION_SHORT,
				current_channel_page);
	} else if (status == MAC_NO_BEACON) {
		/*
		 * No beacon is received; no coordiantor is located.
		 * Scan again, but used longer scan duration.
		 */
		wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
				SCAN_CHANNEL,
				SCAN_DURATION_LONG,
				current_channel_page);
	} else {
		/* Set proper state of application. */
		app_state = APP_IDLE;

		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}

	/* Keep compiler happy. */
	ScanType = ScanType;
	ChannelPage = ChannelPage;
	UnscannedChannels = UnscannedChannels;
}

#endif

/*
 * @brief Callback function usr_mlme_set_conf
 *
 * @param status        Result of requested PIB attribute set operation
 * @param PIBAttribute  Updated PIB attribute
 */

void usr_mlme_set_conf(uint8_t status, uint8_t PIBAttribute, uint8_t PIBAttributeIndex)
{
    if (status != MAC_SUCCESS)
    {
        // something went wrong; restart
        wpan_mlme_reset_req(true);
    }
    else
    {
        switch (PIBAttribute)
        {
            case macPANId:
            {
				/*
				 * Set the Coordinator Short Address of the scanned network.
				 * This is required in order to perform a proper sync
				 * before assocation.
				 */
				wpan_mlme_set_req(macCoordShortAddress,NO_PIB_INDEX, &coord_addr_spec.Addr);
				
			}
            break;

            case macCoordShortAddress:
                 {
	           
				     /* Set security PIB attributes now. */
	                 wpan_mlme_set_req(macDefaultKeySource,
	                 NO_PIB_INDEX,
	                 &default_key_source); 
                }
                 break;

            case macDefaultKeySource:
                 {
	                 uint8_t mac_sec_level_table_entries = 1;

	                 wpan_mlme_set_req(macSecurityLevelTableEntries,
	                 NO_PIB_INDEX,
	                 &mac_sec_level_table_entries);
                 }
                 break;

             case macSecurityLevelTableEntries:
                 {
	                 uint8_t mac_sec_level_table[4] = {FRAME_TYPE_DATA,      // FrameType: Data
		                 CMD_FRAME_ID_NA,      // CommandFrameIdentifier: N/A
		                 ZIP_SEC_MIN,          // SecurityMinimum: 5
		                 DEV_OVERRIDE_SEC_MIN  // DeviceOverrideSecurityMinimum: True
	                 };

	                 wpan_mlme_set_req(macSecurityLevelTable,
	                 0,    // Index: 0
	                 &mac_sec_level_table);
                 }
                 break;

             case macSecurityLevelTable:
                 {
	                 uint8_t mac_key_table_entries = 1;

	                 wpan_mlme_set_req(macKeyTableEntries,
	                 NO_PIB_INDEX,
	                 &mac_key_table_entries);
                 }
                 break;

             case macKeyTableEntries:
                 {
	                 uint8_t mac_key_table[34] =
	                 {
		                 // KeyIdLookupList[1].LookupData : macDefaultKeySource || g_Sec_KeyIndex_1
		                 default_key_source[0], // LookupData[0]
		                 default_key_source[1], // LookupData[1]
		                 default_key_source[2], // LookupData[2]
		                 default_key_source[3], // LookupData[3]
		                 default_key_source[4], // LookupData[4]
		                 default_key_source[5], // LookupData[5]
		                 default_key_source[6], // LookupData[6]
		                 default_key_source[7], // LookupData[7]
		                 KEY_INDEX_1,           // LookupData[8]
		                 LOOKUP_DATA_SIZE_1, // LookupDataSize: 0x01 : Size 9 octets
		                 1,              // KeyIdLookupListEntries = 1
		                 // KeyDeviceList[1]
		                 0,              // DeviceDescriptorHandle
		                 0,              // UniqueDevice - Key is unique per node
		                 0,              // Blacklisted
		                 1,              // KeyDeviceListEntries
		                 //  KeyUsageList
		                 FRAME_TYPE_DATA,    // FrameType - Data frames
		                 CMD_FRAME_ID_NA,    // CommandFrameIdentifier not used in ZIP
		                 1,                  // KeyUsageListEntries
		                 // Key
		                 default_key[0],
		                 default_key[1],
		                 default_key[2],
		                 default_key[3],
		                 default_key[4],
		                 default_key[5],
		                 default_key[6],
		                 default_key[7],
		                 default_key[8],
		                 default_key[9],
		                 default_key[10],
		                 default_key[11],
		                 default_key[12],
		                 default_key[13],
		                 default_key[14],
		                 default_key[15],
	                 };

	                 wpan_mlme_set_req(macKeyTable,
	                 0,    // Index: 0
	                 &mac_key_table);
                 }
                 break;

             case macKeyTable:
                 {
	                 uint8_t mac_dev_table_entries = 1;

	                 wpan_mlme_set_req(macDeviceTableEntries,
	                 NO_PIB_INDEX,
	                 &mac_dev_table_entries);  
                 }
                 break;

